{"frame1.png": "CRUX. WTUISRAH. l", "frame2.png": "CRUX.' E MISSILESTHAT WE SENT FROM GAZA TD ISRAEL", "frame4.png": "MUREIHAN ATHUU ANEBKETS *", "frame6.png": "CRUX.GET THROUGH ; l", "frame8.png": "CRUX.\\a ' ISRAEL'S IRON DOME DEFENCE SYSTEM l", "frame10.png": "WHAI IS .1 MMSYSTEML I,", "frame12.png": "The Iron Dome is a ground-to-air, short-range,air defence system that neutralises rocketsand missiles", "frame13.png": "The Iron Dome is a ground-to-aiv, short-range,air defence system that neutralises rocketsand missiles", "frame15.png": "The concept was born after the2006 Israel-Lebanon War when Israel facedthousands of rockets fired by Hezbollah", "frame17.png": "Israel started working towards a defencetechnology that could save them from airstrikes", "frame19.png": "Israels Iron Dome missile defence system tookyears to develop and was tested in combat forthe first time in April 2011", "frame20.png": "Israel's Iron Dome missile defence system tookyears to develop and was tested in combat forthe first time in April 2011", "frame21.png": "The system is designed to intercept short-rangem siles and rockets coming in from Gaza", "frame22.png": "The system is designed to intercept short-rangemissiles and rockets coming in from Gaza", "frame23.png": "CRUX.HOW DOES THEIR' 5 .3me aYSTEM WORK", "frame25.png": "The Iron Dome has three main systems thatprovide a shield over the deployed area", "frame26.png": "The Iron Dome has three main systems thatprovide a shield over the deployed area", "frame27.png": "The Iron Dome system uses a radar that candetect a missile being fired towards Israel", "frame28.png": "The Iron Dome system uses a radar that candetect a missile being fired towards Israel", "frame30.png": "The system analyses the threat posed by them sile fired by the enemy", "frame32.png": "If the missile is targeting a populated area,the system flres off a missile of Its own attemptingto neutralise the threat", "frame33.png": "If the missile is targeting a populated area,the system flres off a mlsslle of Its own attemptingto neutralise the threat", "frame34.png": "This creates explosions in the sky, a relativelycommon sight across Israel", "frame35.png": "This creates explosions in the sky, a relativelycommon sight across Israel", "frame36.png": "ounlry. Io that I! can kick]. In many mlulluu -onlblo", "frame37.png": "Israel has strategically placed these systems acrossthe country, so that it can tackle as many missilesas possible", "frame38.png": "Ii-IE IRON DOME SYSTE", "frame39.png": "CRUX. THE IRON DOME SYSTEM?", "frame40.png": "According to the manufacturers, the Iron Domedefence system has an accuracy rate of 90%", "frame41.png": "According to the manufacturers, the Iron Domedefence system has an accuracy rate of 90%", "frame42.png": "But experts say that the defence system has beenable to pvovlde an accuracy rate of 80%", "frame43.png": "But experts say that the defence system has beenable to provide an accuracy rate of 80%", "frame45.png": "es 5 cs it was first brought in 10 years ago", "frame47.png": "Israels Iron Dome Defence System is very effectivedespite not being a perfect system", "frame48.png": "Israel's Iron Dome Defence System is very effectivedesplte not belng a perfect system", "frame49.png": "(7Palestine forces are attempting to find the chink inthe Iron Dome system's armour", "frame50.png": ".//Palestine forces are attempting to find the chink inthe Iron Dome system's armour", "frame52.png": "According to experts, the defence systemthat works as a shield for Israel has a saturationpoint, but it is unknown", "frame54.png": "Gaza has fired a high number of missiles totest the saturation point and overwhelm the irondome system", "frame55.png": "Gu- ha \"rod u hlgh number of mlnlln toIn\" Ilurltlon polnt and ovorwholm tho Irondemo I atom", "frame56.png": "PRODUCERSOMESH SINGHEDTOPSAMEER KR. RAI. mm .m.", "frame57.png": "PRODUCERSOMESH SINGHEDTOPSAMEER KR. RAI. mm .m.", "frame58.png": "PRODUCERSOMESH SINGHEDTOPSAMEER KR. RAI. mm .m.", "frame59.png": "PRODUCERSOMESH SINGHEDTOPSAMEER KR. RAI. mm .m."}